<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"fb8843a8ccb610d201de1066ef473c29b08570902045b3b87ac6d9c446a3a648","plan_job_ref":"Job Plan Airflow DAGs #323 at https://github.com/cal-itp/data-infra/actions/runs/16328678599","plan_out_hash":"56980c0d967d5156eec82e6ba2352a4798fa1b55d11df7ae9ac30767051534b0","plan_hash":"fff2b6528f0b7e57eaf98717b8fa3e9d3b2c6e463836a3791ff43c4be56c8a9c","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-partial_parse will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-partial_parse" {
!~      content             = (sensitive value)
!~      crc32c              = "OzNfuQ==" -> (known after apply)
!~      detect_md5hash      = "gQDYRjFTdm3tOMNXeu84Og==" -> "different hash"
!~      generation          = 1752010341206630 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/partial_parse.msgpack"
!~      md5hash             = "gQDYRjFTdm3tOMNXeu84Og==" -> (known after apply)
        name                = "data/warehouse/target/partial_parse.msgpack"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #323](https://github.com/cal-itp/data-infra/actions/runs/16328678599)